TRUNCATE TABLE flower_shop.Supplier RESTART IDENTITY CASCADE;

INSERT INTO flower_shop.Supplier (name, city, contacts)
VALUES
    ('FloraSupply', 'Москва', 'florasupply@mail.com'),
    ('PetalPro', 'Санкт-Петербург', 'petalpro@mail.com'),
    ('Bloomers', 'Казань', 'bloomers@mail.com'),
    ('FreshFlorals', 'Екатеринбург', 'freshflorals@mail.com'),
    ('GreenGarden', 'Новосибирск', 'greengarden@mail.com'),
    ('RoseWorld', 'Сочи', 'rose_world@mail.com'),
    ('TulipMarket', 'Владивосток', 'tulipmarket@mail.com'),
    ('LilyImport', 'Самара', 'lilyimport@mail.com'),
    ('FlowerEx', 'Челябинск', 'flowerex@mail.com'),
    ('FlowerEmpire', 'Краснодар', 'flowerempire@mail.com');

INSERT INTO flower_shop.Product (name_flower, description, price, number_of_remaining)
VALUES
    ('Роза', 'Красная роза, свежая', 250.00, 500),
    ('Тюльпан', 'Тюльпан желтого цвета', 150.00, 300),
    ('Орхидея', 'Орхидея с фиолетовыми цветами', 500.00, 100),
    ('Гербера', 'Яркая гербера, множество цветов', 200.00, 400),
    ('Лилия', 'Белая лилия, красиво раскрытая', 350.00, 150),
    ('Хризантема', 'Желтые хризантемы', 180.00, 350),
    ('Гладиолус', 'Гладиолус красного цвета', 220.00, 250),
    ('Пион', 'Розовый пион с крупными лепестками', 450.00, 80),
    ('Лаванда', 'Лаванда, ароматная трава', 100.00, 600),
    ('Каллы', 'Белые каллы', 350.00, 150);

INSERT INTO flower_shop.Supply (supplier_id, date)
VALUES
    (1, '2024-11-01'),
    (2, '2024-11-05'),
    (3, '2024-11-10'),
    (4, '2024-11-12'),
    (5, '2024-11-15'),
    (6, '2024-11-17'),
    (7, '2024-11-18'),
    (8, '2024-11-20'),
    (9, '2024-11-22'),
    (1, '2024-12-01'),
    (2, '2024-12-05'),
    (10, '2024-11-25');

INSERT INTO flower_shop.Product_X_Supply (supply_id, product_id, amount)
VALUES
    (1, 3, 100),
    (2, 4, 150),
    (3, 2, 200),
    (4, 4, 50),
    (5, 6, 300),
    (6, 1, 250),
    (7, 8, 180),
    (8, 9, 100),
    (9, 5, 220),
    (11, 1, 50),
    (11, 2, 100),
    (12, 3, 30),  
    (12, 4, 60),
    (10, 7, 110);

INSERT INTO flower_shop.Client (first_name, last_name, login, password)
VALUES
    ('Алексей', 'Иванов', 'alexey123', 'password1'),
    ('Мария', 'Петрова', 'maria2024', 'password2'),
    ('Иван', 'Смирнов', 'ivan321', 'password3'),
    ('Екатерина', 'Дмитриева', 'katya444', 'password4'),
    ('Ольга', 'Васильева', 'olga567', 'password5'),
    ('Наталья', 'Соколова', 'natalya11', 'password6'),
    ('Дмитрий', 'Григорьев', 'dmitriy777', 'password7'),
    ('Юлия', 'Морозова', 'yulia888', 'password8'),
    ('Анна', 'Федорова', 'anna999', 'password9'),
    ('Сергей', 'Соловьев', 'sergey000', 'password10');

INSERT INTO flower_shop."Order" (client_id, date, status, price)
VALUES
    (2, '2024-11-10', 'IN_PROGRESS', 3000.00),
    (4, '2024-11-11', 'DELIVERED', 2000.00),
    (6, '2024-11-12', 'PAID', 4500.00),
    (1, '2024-11-13', 'CANCELLED', 1500.00),
    (5, '2024-11-14', 'IN_PROGRESS', 5000.00),
    (3, '2024-11-16', 'DELIVERED', 2200.00),
    (8, '2024-11-17', 'CANCELLED', 2500.00),
    (10, '2024-11-18', 'PAID', 4200.00),
    (7, '2024-11-19', 'IN_PROGRESS', 3100.00),
    (9, '2024-11-20', 'DELIVERED', 5400.00),

    (2, '2024-11-21', 'PAID', 5000.00),
    (2, '2024-11-22', 'DELIVERED', 6000.00),
    (2, '2024-11-23', 'IN_PROGRESS', 7000.00),
    (2, '2024-11-24', 'PAID', 8000.00),
    (3, '2024-11-25', 'DELIVERED', 9000.00),
    (3, '2024-11-26', 'PAID', 10000.00),
    (7, '2023-09-05', 'PAID', 5500.00),
    (8, '2023-09-15', 'DELIVERED', 3500.00),
    (9, '2023-10-10', 'PAID', 7500.00),
    (10, '2023-10-20', 'DELIVERED', 4000.00),
    (1, '2023-11-05', 'PAID', 6500.00),
    (2, '2023-11-15', 'DELIVERED', 3000.00),
    (3, '2023-12-10', 'PAID', 8500.00),
    (1, '2023-07-20', 'PAID', 1600.00),
    (2, '2023-08-15', 'PAID', 1300.00),
    (4, '2023-12-20', 'DELIVERED', 4000.00);

INSERT INTO flower_shop.Product_X_Order (order_id, product_id, amount)
VALUES
    (1, 2, 12),
    (2, 4, 20),
    (3, 1, 8),
    (4, 3, 5),
    (5, 5, 15),
    (6, 7, 30),
    (7, 9, 25),
    (8, 10, 7),
    (9, 6, 18),
    (10, 8, 10),

    (11, 1, 2),
    (11, 2, 3),
    (11, 3, 1),
    (11, 4, 4),
    (12, 5, 2),
    (12, 6, 3),
    (12, 7, 1),
    (12, 8, 4),
    (13, 9, 2),
    (13, 10, 3),
    (13, 1, 1),
    (13, 2, 4),
    (14, 3, 2),
    (14, 4, 3),
    (14, 5, 1),
    (14, 6, 4),
    (15, 7, 2),
    (15, 8, 3),
    (15, 9, 1),
    (15, 10, 4),
    (16, 1, 2),
    (16, 2, 3),
    (16, 3, 1),
    (17, 1, 5),
    (17, 2, 3), 
    (18, 3, 2), 
    (18, 4, 1), 
    (16, 4, 4);

INSERT INTO flower_shop.Department (name)
VALUES
    ('Продажи'),
    ('Логистика'),
    ('Финансовый отдел'),
    ('Маркетинг'),
    ('Рекламный отдел');

INSERT INTO flower_shop.Worker (department_id, first_name, last_name, salary)
VALUES
    (1, 'Сергей', 'Петров', 30000.00),
    (2, 'Анна', 'Сидорова', 35000.00),
    (3, 'Дмитрий', 'Кузнецов', 40000.00),
    (1, 'Ольга', 'Лукина', 25000.00),
    (2, 'Елена', 'Тимофеева', 30000.00),
    (1, 'Петр', 'Ковалев', 28000.00),
    (3, 'Виктор', 'Тимошенко', 32000.00),
    (1, 'Ксения', 'Маркова', 33000.00),
    (4, 'Александр', 'Смирнов', 31000.00),
    (5, 'Ирина', 'Власова', 34000.00);

INSERT INTO flower_shop.Order_X_Worker (order_id, worker_id)
VALUES
    (1, 5),
    (2, 8),
    (3, 4),
    (4, 3),
    (5, 6),
    (6, 8),
    (7, 9),
    (8, 8),
    (9, 7),
    (10, 10);